Revit 2027 API
Application.IsPrecastEnabled Property
 Checks whether or not the precast is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPrecastEnabled { get; set; }
Public Property IsPrecastEnabled As Boolean
	Get
	Set
public:
property bool IsPrecastEnabled {
	bool get ();
	void set (bool value);
}
member IsPrecastEnabled : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. -or- When setting this property: Concrete should be enabled to change Precast.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace